<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2
import sqlalchemy
import requests
from bs4 import BeautifulSoup
from lxml import etree as et

In [2]:
import pandas as pd
from sqlalchemy import create_engine, event
from sqlalchemy.engine.url import URL

In [4]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [5]:
# текст запроса
n = 10
query_3_1 = f'''select
                    count(id)
                from vacancies
                limit {n}
            '''

In [6]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [7]:
# текст запроса
n = 10
query_3_2 = f'''select
                    count(id)
                from employers
                limit {n}
            '''

In [8]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [9]:
# текст запроса
n = 10
query_3_3 = f'''select
                    count(id)
                from areas
                limit {n}
            '''

In [10]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\928149064.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [11]:
# текст запроса
n = 10
query_3_4 = f'''select
                    count(id)
                from industries
                limit {n}
            '''

In [12]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [13]:
# выводы по предварительному анализу данных
#Провели предварительный анализ данных, посчитав количество строк столбцов из ключевой таблицы. Можно делать более точные фильтры, учитывая требуеме запросы.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [14]:
# текст запроса
query_4_1 = f'''select
                    count(v.id) cnt,
                    a.name
                from vacancies v
                join areas a on v.area_id = a.id
                group by 2
                order by 1 desc
            '''

In [15]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

      cnt             name
0    5333           Москва
1    2851  Санкт-Петербург
2    2112            Минск
3    2006      Новосибирск
4    1892           Алматы
..    ...              ...
764     1       Тарко-Сале
765     1    Новоаннинский
766     1            Бирск
767     1           Сасово
768     1             Анна

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [16]:
# текст запроса
query_4_2 = f'''select
                    count(v.id) cnt
                from vacancies v
                where v.salary_from is not null or
                salary_to is not null
            '''

In [17]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\970655580.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

     cnt
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [18]:
# текст запроса
query_4_3 = f'''select
                    avg(v.salary_from),
                    avg(v.salary_to)
                from vacancies v
            '''

In [19]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

            avg            avg
0  71064.657901  110536.741923

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [20]:
# текст запроса
query_4_4 = f'''select
                    count(v.id) cnt,
                    v.schedule,
                    v.employment
                from vacancies v
                group by 2,3
                order by 1 desc
            '''

In [21]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\2022935265.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

      cnt          schedule           employment
0   35367       Полный день     Полная занятость
1    7802  Удаленная работа     Полная занятость
2    1593     Гибкий график     Полная занятость
3    1312  Удаленная работа  Частичная занятость
4     940    Сменный график     Полная занятость
5     569       Полный день           Стажировка
6     367    Вахтовый метод     Полная занятость
7     347       Полный день  Частичная занятость
8     312     Гибкий график  Частичная занятость
9     141       Полный день     Проектная работа
10    133  Удаленная работа     Проектная работа
11    116     Гибкий график           Стажировка
12    101    Сменный график  Частичная занятость
13     64  Удаленная работа           Стажировка
14     18     Гибкий график     Проектная работа
15     12    Сменный график           Стажировка
16      2    Вахтовый метод     Проектная работа
17      1    Сменный график     Проектная работа

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [22]:
# текст запроса
query_4_5 = f'''select
                    count(v.id) cnt,
                    v.experience "Требуемый опыт работы"
                from vacancies v
                group by 2
                order by 1 asc
            '''

In [23]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

     cnt Требуемый опыт работы
0   1337           Более 6 лет
1   7197             Нет опыта
2  14511         От 3 до 6 лет
3  26152    От 1 года до 3 лет

***

In [24]:
# выводы по детальному анализу вакансий
# В этом блоке использовали уже более точную фильтрацию, используя агрегатные функции, а также условия

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [25]:
# текст запроса
query_5_1 = f'''select
                    count(v.id) cnt,
                    e.name
                from vacancies v
                join employers e on v.employer_id = e.id
                group by 2
                order by 1 desc
                limit 5
            '''

In [26]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\3834399874.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

    cnt           name
0  1933         Яндекс
1   491     Ростелеком
2   444       Тинькофф
3   428           СБЕР
4   331  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [27]:
# текст запроса
query_5_2 = f'''select
                    a.name,
                    count(distinct e.name) employer_cnt,
                    count(distinct v.name) vacancies_cnt
                from areas a
                left join vacancies v on a.id = v.area_id
                left join employers e on a.id = e.area
                where v.name is null
                group by 1
                order by 2 desc  
            '''

In [28]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\2250345976.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                               name  employer_cnt  vacancies_cnt
0                            Россия           410              0
1                         Казахстан           207              0
2                Московская область            75              0
3                Краснодарский край            19              0
4                          Беларусь            18              0
..                              ...           ...            ...
588                        Кувандык             0              0
589                        Куйбышев             0              0
590  Куйбышево (Ростовская область)             0              0
591                        Култаево             0              0
592                        Кульсары             0              0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [29]:
# текст запроса
query_5_3 = f'''select
                    count(distinct e.area)
                from employers e 
                left join vacancies v on v.employer_id = e.id
                left join areas a on e.area = a.id
                order by 1 desc
            '''

In [30]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

   count
0    654

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [31]:
# текст запроса
query_5_4 = f'''select*
                from employers e
                left join employers_industries ei on ei.employer_id = e.id 
                where ei.employer_id is null
            '''

In [32]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\3493105328.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

,id,name,area,employer_id,industry_id
0,1840010,филиал ФКУ Налог-Сервис ФНС России в Республик...,88,None,None
1,3251713,НПО Прибор,2045,None,None
2,4437201,DatsTeam,1,None,None
3,2904953,ЧЕЛЯБИНСКИЙ ЗАВОД ТЕХНОЛОГИЧЕСКОЙ ОСНАСТКИ ИМЕ...,104,None,None
4,3731049,Арктик СПГ 2,1,None,None
...,...,...,...,...,...
8414,4653030,Волжские Термы,78,None,None
8415,2523114,МВД России по Республике Башкортостан,99,None,None
8416,6160365,Энова,88,None,None
8417,1441774,МарКо,88,None,None
8418,5636092,ГИМ-КЛИНИКА,99,None,None

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [33]:
# текст запроса
query_5_5 = f'''select
                    e.name employer_name,
                    count(ei.industry_id) industry_cnt
                from employers e
                left join employers_industries ei on e.id = ei.employer_id
                group by 1
                having count(ei.industry_id) = 4
                order by 1 asc
                limit 3
            '''

In [34]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

  employer_name  industry_cnt
0  101 Интернет             4
1      21vek.by             4
2          2ГИС             4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [35]:
# текст запроса
query_5_6 = f'''select
                    count(ei.employer_id) employer_cnt
                from industries i
                left join employers_industries ei on i.id = ei.industry_id
                where i.name = 'Разработка программного обеспечения'
            '''

In [36]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\821628714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   employer_cnt
0          3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [37]:
# код для получения списка городов-милионников
import urllib.request as req
from lxml import etree
cities = []
web = req.urlopen('https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8#%D0%A1%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D0%B3%D0%BE%D1%80%D0%BE%D0%B4%D0%BE%D0%B2-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D0%BE%D0%B2')
s = web.read()
html = etree.HTML(s)
tr_nodes = html.xpath('//*[@id="mw-content-text"]/div[1]/table[2]/tbody/tr/td[2]/a')
for i in tr_nodes:
    cities.append (i.text)

In [38]:
# текст запроса
cities_sql = "','".join(cities)
query_5_7 = f''' 
            select
                a.name,
                count(v.id)
            from vacancies v
            join employers e on v.employer_id = e.id 
            join areas a on a.id = v.area_id 
            where a.name in ('{cities_sql}') and 
            e.name = 'Яндекс' 
            group by 1
            union all
            select
            'Total',
            count(v.id)
            from vacancies v
            join employers e on v.employer_id = e.id 
            join areas a on a.id = v.area_id 
            where a.name in ('{cities_sql}') and 
            e.name = 'Яндекс'  
            order by 2           
'''

In [39]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\1965596796.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7               Уфа     26
8            Самара     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            Total    485

***

In [40]:
# выводы по анализу работодателей
# в данном блоке джойнили таблицы для конкретных запросов. То есть вычленяли данные из нескольких таблиц для получения ответа на вопрос. В последней задаче использовали парсинг данных с сайта для автоматическихи подставлений и изменений данных с сайта Википедии.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [41]:
# текст запроса
query_6_1 = f'''select count(*)
                from vacancies v
                where lower(v.name) like '%data%' or lower(v.name) like '%данн%'
            '''

In [42]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\366702258.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [43]:
# текст запроса
query_6_2 = f'''
                with data_vacancies as(
                select*
                from vacancies 
                where 
                    name ilike '%data scientist%' or 
                    name ilike '%data science%' or
                    name ilike '%исследователь данных%' or
                    (name like '%ML%' and 
                    name not ilike '%HTML%') or
                    name ilike '%machine learning%' or
                    name ilike '%машинн%обучен%'
                )    
                    
                select
                count(name)
                from data_vacancies
                where
                    name ilike '%junior%' or
                    experience ilike '%Нет опыта%' or
                    employment ilike '%Стажировка%'    
            '''

In [44]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\2267038862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [45]:
# текст запроса
query_6_3 = f'''
                with data_vacancies as(
                select*
                from vacancies 
                where 
                    (name ilike '%data scientist%' or 
                    name ilike '%data science%' or
                    name ilike '%исследователь данных%' or
                    (name like '%ML%' and 
                    name not ilike '%HTML%') or
                    name ilike '%machine learning%' or
                    name ilike '%машинн%обучен%')
                )    
                 
                select
                count(name)
                from data_vacancies
                where
                    key_skills ilike '%SQL%' or
                    key_skills ilike '%postgres%'  
            '''

In [46]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\3794299702.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [47]:
# текст запроса
query_6_4 = f'''
                with data_vacancies as(
                select*
                from vacancies 
                where 
                    (name ilike '%data scientist%' or 
                    name ilike '%data science%' or
                    name ilike '%исследователь данных%' or
                    (name like '%ML%' and 
                    name not ilike '%HTML%') or
                    name ilike '%machine learning%' or
                    name ilike '%машинн%обучен%')
                )    
                 
                select
                count(id)
                from data_vacancies
                where
                    key_skills like '%Python%'   
            '''

In [48]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\4264665179.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [49]:
# текст запроса
query_6_5 = f'''
                with data_vacancies as
                (select
                v.name,
                v.key_skills
                from vacancies v
                where 
                    (v.name ilike '%data scientist%' or 
                    v.name ilike '%data science%' or
                    v.name ilike '%исследователь данных%' or
                    (v.name like '%ML%' and 
                    v.name not ilike '%HTML%') or
                    v.name ilike '%machine learning%' or
                    v.name ilike '%машинн%обучен%')
                )   
                 
                select
                round(avg(length(key_skills)-length(replace(key_skills, CHR(9),''))+1),2) num_skills 
                from data_vacancies
                where
                    key_skills is not null   
            '''

In [50]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\3654210517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   num_skills
0        6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [51]:
# текст запроса
query_6_6 = f'''
                with data_vacancies as
                (select*
                from vacancies 
                where 
                    (name ilike '%data scientist%' or 
                    name ilike '%data science%' or
                    name ilike '%исследователь данных%' or
                    (name like '%ML%' and 
                    name not ilike '%HTML%') or
                    name ilike '%machine learning%' or
                    name ilike '%машинн%обучен%')
                                                ),
                                                average_salary    
                as(       
                select
                experience,
                salary_from,
                salary_to,
                case
                when salary_from is not null
                and salary_to is not null then (salary_from + salary_to)/2
                when salary_from is not null and salary_to is not null then salary_to
                when salary_from is not null and salary_to is not null then salary_from
                end as salary
                from data_vacancies
                where
                    salary_from is not null and
                    salary_to is not null 
                    )
                select
                    experience,
                    AVG(salary)
                from average_salary
                group by experience
                 

            '''

In [52]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\Карина\AppData\Local\Temp\ipykernel_8184\519194770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience            avg
0       От 3 до 6 лет  248829.636364
1  От 1 года до 3 лет  162181.928571
2           Нет опыта   89166.666667

***

In [53]:
# выводы по предметному анализу
# в этом блоке нам было интересно иследовать таблицу по вакансиям дата сайнс, а именно осуществить поиск по вакансиям, используя интересующие нас параметры. Сделали фильтр для позиции джуниор, использовали ключевые слова.

# Общий вывод по проекту

In [54]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
# с помощью запросо sql научились проводить анализ данных, использовать логику присоединения таблиц, научились обращаться к данным, парсить данные с сайта, применять фильтры, условия.